[
  {
    "id": "kevin",
    "name": "Kevin",
    "role": "Vocals, Flute, Guitar",
    "image": "/images/members/kevin.jpg",
    "bio": "Kevin got his first tin whistle on his eighth birthday and from there on out it was all music. Growing up in Cleveland, life was steeped in Irish American culture. Playing with Respectable Hooligans and Scully all across the greater Cleveland area he earned his chops in pubs, The Cleveland Irish Festival, Lake County Irish Festival and countless other gigs. Opening for bands like Derek Warfield and the Young Wolfetones, The Dublin City Ramblers, The Wolverines and many others he was always encouraged to keep playing. Later playing with Mossy Moran, Kevin had many opportunities to travel and play including a week stint at Ri Ra Pub at the Mandalay Bay Hotel in Las Vegas. In 2012 Kevin moved to Portland and shortly after met Noah and Casey and the Clevelanders and Portland lads have been playing since."
  },
  {
    "id": "casey",
    "name": "Casey",
    "role": "Tenor Banjo, Tin Whistle",
    "image": "/images/members/casey.jpg",
    "bio": "Casey was born and raised in Oregon, and owes his love of music to his parents. Throughout his childhood, his mother felt a deep connection to her Irish roots and had folk musics of all sorts playing in her art studio, and his father played country in his shop. The influence did not stop there. One day when Casey was 15, his mother asked if he would be interested in learning the tin whistle. An enthusiastic \"yes\" launched him into the world of Irish music. Throughout the years, Casey has performed on instruments of all shapes and sizes, jumping into each challenge with a passion. In high school he played around Portland with a student band ran by the great teacher Jan DeWeese. From there, Casey performed with many musicians throughout college and beyond. In the summer of 2014, he met the original members of Biddy at a music jam party and joined the bench soon after."
  },
  {
    "id": "trevor",
    "name": "Trevor",
    "role": "Fiddle",
    "image": "/images/members/trevor.jpg",
    "bio": "Trevor began taking viola lessons when he was 9. His school's orchestra and teachers immersed him in the world of classical orchestral music while his friends and family ignited his interest in Irish, American Old-Time, and Bluegrass music. Drawing inspiration from the various collaborations of American musicians including Yo-Yo Ma, Chris Thile, Mark O'Connor, Tim O'Brien, and Bela Fleck among many others, he began learning how to fiddle and play the mandolin. He went on to study music at Ohio State University earning a Bachelor of Music Education. Trevor has taught Orchestra, General Music, and Beginning Band at public schools in Ohio, Florida, and California respectively. Trevor moved to Portland in early 2017 to rejoin his long-time friends who had formed Biddy on the Bench."
  }
]
