[
  "Biddy on the Bench traces its origins to the winter of 2013, when its founding members came together more by coincidence than design. Kevin, Casey, Maeve, and Nick quickly found common ground in their shared love of Irish traditional music, carving out a niche in Portland, Oregon's folk scene with a lively mix of ballads, pub classics, rebel songs, harmonized shanties, and driving dance tunes.",
  "In 2017, the lineup expanded with the arrival of Tristan, followed soon after by his brother Trevor, deepening the band's sound and broadening its reach. An ever-growing schedule of pub gigs, Highland games, Celtic festivals, and private events across the Pacific Northwest cultivated a loyal and enthusiastic audience. Whether leading a packed room in chorus or setting feet flying at a ceili, Biddy on the Bench became known for its energy, authenticity, and camaraderie.",
  "Before departing in early 2019 to pursue other paths, Nick joined the six-piece in recording their first single with Billy Oskay at Big Red Studio - a milestone that captured the spirit of the band's early years. As a five-piece, Biddy continued to refine and expand its sound, culminating in the spring 2020 release of their debut album, Make the Rafter Roar. Though the timing coincided with a world suddenly gone quiet, the music endured.",
  "When venues reopened in 2021, Biddy returned to stages across the region, once again delivering traditional songs and tunes to welcoming crowds. Around that time, Tristan relocated across the country. In 2024, founding member Maeve stepped away from the band after more than a decade of shaping its sound and spirit, marking the close of a significant chapter in Biddy's story.",
  "Today, Biddy on the Bench carries on as a dynamic trio - Kevin, Casey, and Trevor - raising song and spirited dance tunes in pubs, festivals, and ceilis throughout the Pacific Northwest. Built on the foundation laid over more than a decade of shared stages and songs, the Biddy sound remains as rousing as ever - ready for raised glasses, full voices, and crowded pubs."
]
